---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralTopFinishingTurns
source: html/41498964-03ef-d047-ab40-cee8dd284baf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeSpiralTopFinishingTurns Property

"Top Finishing Turns"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeSpiralTopFinishingTurns { get; }
```